In [1]:
#Next
# slicing,loc,iloc
# replace
#EDA

In [11]:
import pandas as pd
import random
import numpy as np


data = {'Name':['Ajay','Karan','Ravi',np.nan,'Akshay'],
       'Age':[23,np.nan,34,np.nan,32],
       'Salary':[23455,45667,56789,np.nan,87876]}

data

df = pd.DataFrame(data)

In [12]:
df

     Name   Age   Salary
0    Ajay  23.0  23455.0
1   Karan   NaN  45667.0
2    Ravi  34.0  56789.0
3     NaN   NaN      NaN
4  Akshay  32.0  87876.0

In [13]:
# indexing and slicing

In [14]:
df['Name'][3]

nan

In [15]:
df['Name'][1:]

1     Karan
2      Ravi
3       NaN
4    Akshay
Name: Name, dtype: object

In [17]:
df['Name'][1:4]

1    Karan
2     Ravi
3      NaN
Name: Name, dtype: object

In [19]:
df['Name'][1:4] = ['Karan Khanna','Ravi Verma','Ajay Paaji']

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_13624\1770867909.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][1:4] = ['Karan Khanna','Ravi Verma','Ajay Paaji']

In [20]:
df

           Name   Age   Salary
0          Ajay  23.0  23455.0
1  Karan Khanna   NaN  45667.0
2    Ravi Verma  34.0  56789.0
3    Ajay Paaji   NaN      NaN
4        Akshay  32.0  87876.0

In [23]:
df['Salary'][1:4] = np.random.randint(45678,87654,3)

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_13624\4205218273.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Salary'][1:4] = np.random.randint(45678,87654,3)

In [24]:
df

           Name   Age   Salary
0          Ajay  23.0  23455.0
1  Karan Khanna   NaN  72665.0
2    Ravi Verma  34.0  82890.0
3    Ajay Paaji   NaN  53860.0
4        Akshay  32.0  87876.0

In [25]:
# loc

In [27]:
df['Name']

0            Ajay
1    Karan Khanna
2      Ravi Verma
3      Ajay Paaji
4          Akshay
Name: Name, dtype: object

In [29]:
df.loc

In [30]:
# loc[row,col]

In [31]:
df

           Name   Age   Salary
0          Ajay  23.0  23455.0
1  Karan Khanna   NaN  72665.0
2    Ravi Verma  34.0  82890.0
3    Ajay Paaji   NaN  53860.0
4        Akshay  32.0  87876.0

In [32]:
df.loc[:,'Name']

0            Ajay
1    Karan Khanna
2      Ravi Verma
3      Ajay Paaji
4          Akshay
Name: Name, dtype: object

In [35]:
df.loc[1:3,'Name']

1    Karan Khanna
2      Ravi Verma
3      Ajay Paaji
Name: Name, dtype: object

In [37]:
# df

In [40]:
df.loc[1:3,'Name']  = ['Mr Karan','Mr Ravi','Mr Ajay']

In [41]:
df

       Name   Age   Salary
0      Ajay  23.0  23455.0
1  Mr Karan   NaN  72665.0
2   Mr Ravi  34.0  82890.0
3   Mr Ajay   NaN  53860.0
4    Akshay  32.0  87876.0

In [42]:
df.loc[::2,'Name']

0       Ajay
2    Mr Ravi
4     Akshay
Name: Name, dtype: object

In [43]:
df.loc[::2,'Name'] = ['Ajay Bhai']*3

In [44]:
df

        Name   Age   Salary
0  Ajay Bhai  23.0  23455.0
1   Mr Karan   NaN  72665.0
2  Ajay Bhai  34.0  82890.0
3    Mr Ajay   NaN  53860.0
4  Ajay Bhai  32.0  87876.0

In [45]:
df.loc[1:3:2,'Age']

1   NaN
3   NaN
Name: Age, dtype: float64

In [50]:
df.loc[1:3:2,'Age'] = [120,130]

In [51]:
df

        Name    Age   Salary
0  Ajay Bhai   23.0  23455.0
1   Mr Karan  120.0  72665.0
2  Ajay Bhai   34.0  82890.0
3    Mr Ajay  130.0  53860.0
4  Ajay Bhai   32.0  87876.0

In [53]:
df.loc[:2,'Salary'] = 50000

In [54]:
df

        Name    Age   Salary
0  Ajay Bhai   23.0  50000.0
1   Mr Karan  120.0  50000.0
2  Ajay Bhai   34.0  50000.0
3    Mr Ajay  130.0  53860.0
4  Ajay Bhai   32.0  87876.0

In [56]:
df.loc[3:,'Salary'] = 70000

In [57]:
df

        Name    Age   Salary
0  Ajay Bhai   23.0  50000.0
1   Mr Karan  120.0  50000.0
2  Ajay Bhai   34.0  50000.0
3    Mr Ajay  130.0  70000.0
4  Ajay Bhai   32.0  70000.0

In [59]:
df.loc[:,'Name':'Age']

        Name    Age
0  Ajay Bhai   23.0
1   Mr Karan  120.0
2  Ajay Bhai   34.0
3    Mr Ajay  130.0
4  Ajay Bhai   32.0

In [61]:
df.loc[0,'Name':'Age']

Name    Ajay Bhai
Age          23.0
Name: 0, dtype: object

In [62]:
df.loc[0,'Name':'Age'] = ['Mr Akshay Kumar',34]

In [63]:
df

              Name    Age   Salary
0  Mr Akshay Kumar   34.0  50000.0
1         Mr Karan  120.0  50000.0
2        Ajay Bhai   34.0  50000.0
3          Mr Ajay  130.0  70000.0
4        Ajay Bhai   32.0  70000.0

In [65]:
df.loc[1,]

Name      Mr Karan
Age          120.0
Salary     50000.0
Name: 1, dtype: object

In [67]:
df.loc[1,:] = ['Kiran',23,76543]

In [68]:
df

              Name    Age   Salary
0  Mr Akshay Kumar   34.0  50000.0
1            Kiran   23.0  76543.0
2        Ajay Bhai   34.0  50000.0
3          Mr Ajay  130.0  70000.0
4        Ajay Bhai   32.0  70000.0

In [72]:
df.loc[3,:] = ['Ajay Sharma',12,12]

In [73]:
df

              Name   Age   Salary
0  Mr Akshay Kumar  34.0  50000.0
1            Kiran  23.0  76543.0
2        Ajay Bhai  34.0  50000.0
3      Ajay Sharma  12.0     12.0
4        Ajay Bhai  32.0  70000.0

In [75]:
df.loc[1:2,:] = ['Kiran verma',12,987587],['Ajay Ji',23,98]

In [76]:
df

              Name   Age    Salary
0  Mr Akshay Kumar  34.0   50000.0
1      Kiran verma  12.0  987587.0
2          Ajay Ji  23.0      98.0
3      Ajay Sharma  12.0      12.0
4        Ajay Bhai  32.0   70000.0

In [77]:
df.loc[[0,3,4],:]

              Name   Age   Salary
0  Mr Akshay Kumar  34.0  50000.0
3      Ajay Sharma  12.0     12.0
4        Ajay Bhai  32.0  70000.0

In [78]:
df.loc[[0,3,4],:] = [['Akshay Mr',43,5],
                     ['Sahrma Ajay',21,21],
                    ['Bhai Ajay',23,7]]

In [79]:
df

          Name   Age    Salary
0    Akshay Mr  43.0       5.0
1  Kiran verma  12.0  987587.0
2      Ajay Ji  23.0      98.0
3  Sahrma Ajay  21.0      21.0
4    Bhai Ajay  23.0       7.0

In [81]:
df.loc[2,'Age'] = 234

In [82]:
df

          Name    Age    Salary
0    Akshay Mr   43.0       5.0
1  Kiran verma   12.0  987587.0
2      Ajay Ji  234.0      98.0
3  Sahrma Ajay   21.0      21.0
4    Bhai Ajay   23.0       7.0

In [84]:
df['Address'] = ['Noida','Delhi','Kanpur','Bihar','Haryana']

In [85]:
df

          Name    Age    Salary  Address
0    Akshay Mr   43.0       5.0    Noida
1  Kiran verma   12.0  987587.0    Delhi
2      Ajay Ji  234.0      98.0   Kanpur
3  Sahrma Ajay   21.0      21.0    Bihar
4    Bhai Ajay   23.0       7.0  Haryana

In [86]:
df.loc[[0,4],['Name','Address']]

        Name  Address
0  Akshay Mr    Noida
4  Bhai Ajay  Haryana

In [137]:
df.loc[[0,4],['Name','Address']] = (('Akshay Kumar','Mumbai'),
                                    ('Ajay Devgan','Navi Mumbai'))

In [138]:
df

           Name  Age  Salary      Address
0  Akshay Kumar    1       1       Mumbai
1   KIRAN VERMA    2       2        DELHI
2       AJAY JI    3       3       KANPUR
3   SAHRMA AJAY    4      45        BIHAR
4   Ajay Devgan    5       5  Navi Mumbai

In [95]:
df.loc[:,'Address'] = df.loc[:,'Address'].str.upper()

In [96]:
df

           Name    Age    Salary      Address
0  Akshay Kumar   43.0       5.0       MUMBAI
1   Kiran verma   12.0  987587.0        DELHI
2       Ajay Ji  234.0      98.0       KANPUR
3   Sahrma Ajay   21.0      21.0        BIHAR
4   Ajay Devgan   23.0       7.0  NAVI MUMBAI

In [99]:
df.loc[:,'Name'] = df.loc[:,'Name'].str.upper()

In [100]:
df

           Name    Age    Salary      Address
0  AKSHAY KUMAR   43.0       5.0       MUMBAI
1   KIRAN VERMA   12.0  987587.0        DELHI
2       AJAY JI  234.0      98.0       KANPUR
3   SAHRMA AJAY   21.0      21.0        BIHAR
4   AJAY DEVGAN   23.0       7.0  NAVI MUMBAI

In [101]:
# iloc

In [104]:
df.iloc[:,0]

0    AKSHAY KUMAR
1     KIRAN VERMA
2         AJAY JI
3     SAHRMA AJAY
4     AJAY DEVGAN
Name: Name, dtype: object

In [105]:
df.iloc[:,2]

0         5.0
1    987587.0
2        98.0
3        21.0
4         7.0
Name: Salary, dtype: float64

In [106]:
df.iloc[:,2] = [1,2,3,45,5]

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_13624\728107913.py:1: DeprecationWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  df.iloc[:,2] = [1,2,3,45,5]

In [107]:
df

           Name    Age  Salary      Address
0  AKSHAY KUMAR   43.0       1       MUMBAI
1   KIRAN VERMA   12.0       2        DELHI
2       AJAY JI  234.0       3       KANPUR
3   SAHRMA AJAY   21.0      45        BIHAR
4   AJAY DEVGAN   23.0       5  NAVI MUMBAI

In [112]:
df.iloc[0:5,0:4]

           Name    Age  Salary      Address
0  AKSHAY KUMAR   43.0       1       MUMBAI
1   KIRAN VERMA   12.0       2        DELHI
2       AJAY JI  234.0       3       KANPUR
3   SAHRMA AJAY   21.0      45        BIHAR
4   AJAY DEVGAN   23.0       5  NAVI MUMBAI

In [113]:
df.iloc[:5,:4]

           Name    Age  Salary      Address
0  AKSHAY KUMAR   43.0       1       MUMBAI
1   KIRAN VERMA   12.0       2        DELHI
2       AJAY JI  234.0       3       KANPUR
3   SAHRMA AJAY   21.0      45        BIHAR
4   AJAY DEVGAN   23.0       5  NAVI MUMBAI

In [124]:
df.loc[:,'Age'] = [1,2,3,4,5]

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_13624\3909073917.py:1: DeprecationWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  df.loc[:,'Age'] = [1,2,3,4,5]

In [125]:
df

           Name  Age  Salary      Address
0  AKSHAY KUMAR    1       1       MUMBAI
1   KIRAN VERMA    2       2        DELHI
2       AJAY JI    3       3       KANPUR
3   SAHRMA AJAY    4      45        BIHAR
4   AJAY DEVGAN    5       5  NAVI MUMBAI

In [128]:
df.loc[:,['Age','Salary']]

   Age  Salary
0    1       1
1    2       2
2    3       3
3    4      45
4    5       5

In [131]:
df

           Name  Age  Salary      Address
0  AKSHAY KUMAR    1       1       MUMBAI
1   KIRAN VERMA    2       2        DELHI
2       AJAY JI    3       3       KANPUR
3   SAHRMA AJAY    4      45        BIHAR
4   AJAY DEVGAN    5       5  NAVI MUMBAI

In [136]:
df.loc[:,'Age':'Salary'] = [1,2,3,4,5],[5,4,3,2,1]

ValueError: Must have equal len keys and value when setting with an ndarray

In [141]:
df.loc[0:4,['Age','Salary']] =

ValueError: Must have equal len keys and value when setting with an ndarray

In [148]:
df.loc[0:1,['Name','Age']] = ['ABC',12],['BCD',34]

In [149]:
df

          Name  Age  Salary      Address
0          ABC   12       1       Mumbai
1          BCD   34       2        DELHI
2      AJAY JI    3       3       KANPUR
3  SAHRMA AJAY    4      45        BIHAR
4  Ajay Devgan    5       5  Navi Mumbai

In [151]:
df.loc[0:4,['Name','Age']]

          Name  Age
0          ABC   12
1          BCD   34
2      AJAY JI    3
3  SAHRMA AJAY    4
4  Ajay Devgan    5

In [153]:
df.loc[:,['Age','Salary']] = [[1,2],[3,4],[4,5],[6,7],[7,8]]

In [154]:
df

          Name  Age  Salary      Address
0          ABC    1       2       Mumbai
1          BCD    3       4        DELHI
2      AJAY JI    4       5       KANPUR
3  SAHRMA AJAY    6       7        BIHAR
4  Ajay Devgan    7       8  Navi Mumbai

In [156]:
df.iloc[:,1:3] = [[11,2345678],
                  [12,23456],
                  [23,34567],
                  [34,3456789],
                  [56,345678]]

In [157]:
df

          Name  Age   Salary      Address
0          ABC   11  2345678       Mumbai
1          BCD   12    23456        DELHI
2      AJAY JI   23    34567       KANPUR
3  SAHRMA AJAY   34  3456789        BIHAR
4  Ajay Devgan   56   345678  Navi Mumbai

In [158]:
# 0,2,3

In [162]:
df.iloc[[0,2,3],[0,3]]

          Name Address
0          ABC  Mumbai
2      AJAY JI  KANPUR
3  SAHRMA AJAY   BIHAR

In [163]:
df.iloc[[0,2,3],[0,3]] = [['Mohan Verma','Navi Delhi'],
                         ['Karan Malhotra','Old Mumbai'],
                         ['Ajay Dubey','Dubey Nagri']]

In [164]:
df

             Name  Age   Salary      Address
0     Mohan Verma   11  2345678   Navi Delhi
1             BCD   12    23456        DELHI
2  Karan Malhotra   23    34567   Old Mumbai
3      Ajay Dubey   34  3456789  Dubey Nagri
4     Ajay Devgan   56   345678  Navi Mumbai

In [ ]:
#next #columns
# index, reset_index
# rename
# datetime
# str func
# EDA